Revit 2027 API
SelectionChangedEventArgs Class
 The event arguments used by the SelectionChanged event.
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
 Autodesk.Revit.UI.Events.SelectionChangedEventArgs
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SelectionChangedEventArgs : RevitAPISingleEventArgs
Public Class SelectionChangedEventArgs
	Inherits RevitAPISingleEventArgs
public ref class SelectionChangedEventArgs : public RevitAPISingleEventArgs
type SelectionChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
The SelectionChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Top
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDocument |  Returns the document associated with this event.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetReferences |  Returns the references that are currently selected.
GetSelectedElements |  Returns ElementIds of selected elements.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI.Events Namespace